[{"title":"Lord of the Flies","publisher":"National Geographic Books","description":"Golding’s iconic 1954 novel, now with a new foreword by Lois Lowry, remains one of the greatest books ever written for young adults and an unforgettable classic for readers of any age. This edition includes a new Suggestions for Further Reading by Jennifer Buehler. At the dawn of the next world war, a plane crashes on an uncharted island, stranding a group of schoolboys. At first, with no adult supervision, their freedom is something to celebrate. This far from civilization they can do anything they want. Anything. But as order collapses, as strange howls echo in the night, as terror begins its reign, the hope of adventure seems as far removed from reality as the hope of being rescued.","category":["Fiction"]},{"title":"Venom","publisher":"Pocket Books","description":"What kind of assassin works pro bono? It’s hard to be a badass assassin when a giant is beating the crap out of you. Luckily, I never let pride get in the way of my work. My current mission is personal: annihilate Mab Monroe, the Fire elemental who murdered my family. Which means protecting my identity, even if I have to conceal my powerful Stone and Ice magic when I need it most. To the public, I’m Gin Blanco, owner of Ashland’s best barbecue joint. To my friends, I’m the Spider, retired assassin. I still do favors on the side. Like ridding a vampire friend of her oversized stalker—Mab’s right-hand goon who almost got me dead with his massive fists. At least irresistible Owen Grayson is on my side. The man knows too much about me, but I’ll take my chances. Then there’s Detective Bria Coolidge, one of Ashland’s finest. Until recently, I thought my baby sister was dead. She probably thinks the same about me. Little does she know, I’m a cold-blooded killer . . . who is about to save her life.","category":["Fiction"]},{"title":"My Own True Ghost Story","publisher":"Weiser Books","description":"Varla Ventura, Coast to Coast favorite, Weird News blogger on Huffington Post, and author of The Book of the Bizarre and Beyond Bizarre, introduces Weiser Books’ new Collection of forgotten occult classics. Paranormal Parlor is an eerie assemblage of affordable digital editions, curated with Varla’s sixth sense for tales of the weird and unusual. A wild ride on a train bound for ghosttown, this beautifully crafted story from the author famous for The Jungle Book takes readers to a place where the dead not only outnumber the living, they celebrate more too.","category":["Fiction"]},{"title":"The Bear and the Nightingale","publisher":"Del Rey","description":"Katherine Arden’s bestselling debut novel spins an irresistible spell as it announces the arrival of a singular talent with a gorgeous voice. “A beautiful deep-winter story, full of magic and monsters and the sharp edges of growing up.”—Naomi Novik, bestselling author of Uprooted Winter lasts most of the year at the edge of the Russian wilderness, and in the long nights, Vasilisa and her siblings love to gather by the fire to listen to their nurse’s fairy tales. Above all, Vasya loves the story of Frost, the blue-eyed winter demon. Wise Russians fear him, for he claims unwary souls, and they honor the spirits that protect their homes from evil. Then Vasya’s widowed father brings home a new wife from Moscow. Fiercely devout, Vasya’s stepmother forbids her family from honoring their household spirits, but Vasya fears what this may bring. And indeed, misfortune begins to stalk the village. But Vasya’s stepmother only grows harsher, determined to remake the village to her liking and to groom her rebellious stepdaughter for marriage or a convent. As the village’s defenses weaken and evil from the forest creeps nearer, Vasilisa must call upon dangerous gifts she has long concealed—to protect her family from a threat sprung to life from her nurse’s most frightening tales. Praise for The Bear and the Nightingale “Arden’s debut novel has the cadence of a beautiful fairy tale but is darker and more lyrical.”—The Washington Post “Vasya [is] a clever, stalwart girl determined to forge her own path in a time when women had few choices.”—The Christian Science Monitor “Stunning . . . will enchant readers from the first page. . . . with an irresistible heroine who wants only to be free of the bonds placed on her gender and claim her own fate.”—Publishers Weekly (starred review) “Utterly bewitching . . . a lush narrative . . . an immersive, earthy story of folk magic, faith, and hubris, peopled with vivid, dynamic characters, particularly clever, brave Vasya, who outsmarts men and demons alike to save her family.”—Booklist (starred review) “An extraordinary retelling of a very old tale . . . The Bear and the Nightingale is a wonderfully layered novel of family and the harsh wonders of deep winter magic.”—Robin Hobb","category":["Fiction"]},{"title":"Malevolent Banshe","publisher":"Weiser Books","description":"Varla Ventura, fan favorite on Huffington Post’s Weird News, frequent guest on Coast to Coast, and bestselling author of The Book of the Bizarre and Beyond Bizarre, introduces a new Weiser Books Collection of forgotten crypto-classics. Magical Creatures is a hair-raising herd of affordable digital editions, curated with Varla’s affectionate and unerring eye for the fantastic. Not all banshees are created equal. Most commonly thought of as mournful beauties, the malevolent banshees give demons a run for their money. An encounter with one of these beings will leave you weak-kneed and wretched for life. Noted Irish ghost expert Elliot O'Donnell brings the hideous creature to life in The Malevolent Banshee.","category":["Fiction"]},{"title":"Black Widow","publisher":"Simon and Schuster","description":"After unfortunate \"coincidences\" befall her friends, Gin Blanco, aka the Spider, discovers that she has a new enemy, the mysteriously named M. M. Monroe, who, trying to get her framed for murder, has a master plan that will take more than her powerful Ice and Stone magic to stop. By a best-selling author. Original. 60,000 first printing.","category":["Fiction"]},{"title":"A Year in Europe Mystery Bundle: Vengeance in Vienna (#3) and A Fatality in Spain (#4)","publisher":"Blake Pierce","description":"A bundle of VENGEANCE IN VIENNA (Book #3) and A FATALITY IN SPAIN (Book #4) in Blake Pierce’s A Year in Europe Mystery series! This bundle offers books three and four in one convenient file, with over 100,000 words of reading. In VENGEANCE IN VIENNA (Book #3), Diana travels to Vienna, hoping to fulfill her bucket list dream of being moved to tears by music. She is overwhelmed by the beauty, history and culture of the city and wonders if she’s finally settling into her trip in Europe—when an unforeseen catastrophe turns her plans upside down. Can Diana investigate her way out of this one? In A FATALITY IN SPAIN (Book #4), Diana decides to let go and take a chance at love, meeting up with her newfound friend in Barcelona, and trying to muster the courage to fulfill her lifelong dream of running with the bulls in Pamplona. Between the great food, the sunny streets, and her new love, life seems alive again—until a murder turns her world upside down. Can Diana save the case and herself—along with her summer? A YEAR IN EUROPE is a charming and laugh-out-loud cozy mystery series, packed with food and travel, with mysteries that will leave you on the edge of your seat, and with experiences that will leave you with a sense of wonder. As Diana embarks on her quixotic quest for love and meaning, you will find yourself falling in love and rooting for her. You will be in shock at the twists and turns her journey takes as she somehow finds herself at the center of a mystery, and must play amateur sleuth to solve it. Fans of books like Eat, Pray, Love and Under the Tuscan Sun have finally found the cozy mystery series they’ve been hoping for!","category":["Fiction"]},{"title":"The Great Book of Amber","publisher":"Avon Books","description":"All ten of Roger Zelzany's classic Amber fantasy novels in one book! Join Corwin, Merlin and the others in wild adventures in the lands of Amber, Earth, and the Courts of Chaos, where the powers of Amber and Chaos constantly battle for supremacy through intrigue and adventure. Revisit Amber, the land of mystery, adventure and romance. Amber, the one true world. All other worlds, including our Earth, are merely Shadows.","category":["Fiction"]},{"title":"Books of a Feather","publisher":"National Geographic Books","description":"In this novel in the New York Times bestselling Bibliophile Mystery series, San Francisco book-restoration expert Brooklyn Wainwright’s latest project is for the birds, but it may have her running for her life. . . . Brooklyn’s friend runs the Covington Library, which is hosting an exhibit featuring John James Audubon’s massive masterpiece, Birds of America. During the gala celebrating the book, she is approached by Jared Mulrooney, the president of the Bay Area Birdwatchers Society, to repair a lesser known book of Audubon drawings. At the same party, Brooklyn is flying high after she’s asked to refurbish a rare copy of Poor Richard’s Almanack when Mulrooney’s body is discovered in the library. Soon more troubles ruffle Brooklyn’s feathers. Her parents pop in for a visit with an unsavory friend in tow, and there’s a strange man on her tail. With danger beginning to circle Brooklyn’s every move, it’s clear she must find answers before things really go south. . . .","category":["Fiction"]},{"title":"How We Disappeared","publisher":"Hanover Square Press","description":"LONGLISTED FOR THE WALTER SCOTT PRIZE LONGLISTED FOR THE 2020 WOMEN'S PRIZE A LIBRARY JOURNAL EMERGING STARS PICK A mesmerizing novel of World War II Singapore, \"a story about memory, trauma, and ultimately love\" (New York Times)--for fans of Pachinko and We Were the Lucky Ones Singapore, 1942. As Japanese troops sweep down Malaysia and into Singapore, a village is ransacked, leaving only two survivors and one tiny child. In a neighboring village, seventeen-year-old Wang Di is strapped into the back of a troop carrier and shipped off to a Japanese military brothel where she is forced into sexual slavery as a \"comfort woman.\" After sixty years of silence, what she saw and experienced still haunts her. In the year 2000, twelve-year-old Kevin is sitting beside his ailing grandmother when he overhears a mumbled confession. He sets out to discover the truth, wherever it might lead, setting in motion a chain of events he never could have foreseen. Weaving together two timelines and two very big secrets, this stunning debut opens a window on a little-known period of history, revealing the strength and bravery shown by numerous women in the face of terrible cruelty. Drawing in part on her family's experiences, Jing-Jing Lee has crafted a profoundly moving, unforgettable novel about human resilience, the bonds of family and the courage it takes to confront the past.","category":["Fiction"]}]